news_articles_app/app/controllers/articles_controller.rb

    def index
        @articles = Article.where(user_id: params[:user_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 5]]

 def create
    puts params[:urlToImage]
    @article = Article.create(

      title: params[:title],
      author: params[:author],
      description: params[:description],
      url: params[:url],
      urlToImage: params[:urlToImage],
      publishedAt: params[:publishedAt],
      user_id: current_user.id
    )
---
INSERT INTO "articles" ("title", "author", "description", "url", "urlToImage", "publishedAt", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def destroy
    Article.destroy(params[:id])
    render json: Article.all
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 51]]
SELECT "articles".* FROM "articles"